TEMPLATE = app
CONFIG += console c++11
CONFIG -= app_bundle
CONFIG -= qt

SOURCES += main.cpp


# РАБОТА  СО  СТРУКТУРАМИ  ДАННЫХ

# Цедь работы:  ознакомление и приобретение навыков алгоритмизации задач методом структурной декомпозиции,
#               описания и обработки структур разнотипных данных средствами языка С/С++
#               и отладки программ в учебном варианте  инструментальной среды Bloodshed Dev-C++.

# Структура NOTE с полями:
#   - фамилия, имя;
#   - номер телефона;
#   - день рождения в виде массива из трех чисел.
#
# Действия с массивом структур:
#   - сортировка записей в массиве по первым трем цифрам номера телефона в порядке возрастания и вывод его на зкран компьютера;
#   - определение и вывод на экран записей, в которых фамилия совпадает со значением, введенным с клавиатуры, либо сообщение об отсутствии таковых.
